#Область ОбработчикиСобытийФормы   

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)   
	
	ВКМ_ИзменениеРеквизитов();  
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ВКМ_ИзменениеРеквизитов();
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ИзменениеРеквизитов()
		
	Если Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 	
		
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			
Иначе
	
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина; 
				
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


