// Общий модуль ВКМ_Телегам
Функция ОтправитьСообщение(ТекстСообщения) Экспорт
	// Получаем токен и chat_id из констант
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ChatId = Константы.ВКМ_ИндентификаторГруппыДляОповещения.Получить();
	
	Если ПустаяСтрока(Токен) Или ПустаяСтрока(ChatId) Тогда
		Сообщить("Ошибка: токен или chat_id не заданы в константах.");
		Возврат Ложь;
	КонецЕсли;
	
	//Устанавливаем соединение указание адреса
	//сервер api.telegram.org (хост)
	//443, // порт, по умолчанию для http используется 80, для https 443 
	//Новый ЗащищенноеСоединениеOpenSSL() 
	
	Соединение =  Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	//Создаем струкуру для интеграции 
	Данные = новый структура;
	Данные.Вставить("chat_id",ChatId);
	Данные.Вставить("text",ТекстСообщения); 
	
	//Записываем данные в JSON 
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);
	СтрокаЗапроса = ЗаписьJSON.Закрыть(); 
	
	//Установка заголовка
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");  
	
	//запрос 
	Запрос = Новый HTTPЗапрос("bot"+ Токен + "/sendMessage", Заголовки); 
	
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);  
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос); 
	
	
КонецФункции

Процедура ВКМ_ОтправкаСообщения() Экспорт  
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВКМ_УведомленияТелеграмм.ТекстСообщения КАК ТекстСообщения
	//|ИЗ
	//|	Справочник.ВКМ_УведомленияТелеграмм КАК ВКМ_УведомленияТелеграмм";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Сообщение = "";
	//Пока Выборка.Следующий() Цикл
	//	
	//	СообщениеСтока = Выборка.ТекстСообщения;
	//	
	//	Сообщение = Сообщение + СообщениеСтока + Символы.ПС;
	//	
	//КонецЦикла;
	
	
	ОтправитьСообщение(Справочники.ВКМ_УведомленияТелеграм.ОтправкаСообщенияТелеграм()); 
	Справочники.ВКМ_УведомленияТелеграм.ОчиститьСправочник();
	
КонецПроцедуры


