 
&НаКлиенте
Процедура ВидимостьПроцента()     
	
	КатегорияСотрудников = КатегорияСотрудника();
	Если КатегорияСотрудников = ПредопределенноеЗначение("Перечисление.ВКМ_КатегорияСотрудника.Специалист") Тогда 
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе 
		Элементы.ПроцентОтРабот.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КатегорияСотрудника()
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ФизическиеЛица.КатегорияСотрудников КАК КатегорияСотрудников
		|ИЗ
		|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
		|ГДЕ
		|	ВКМ_ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Запись.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияСотрудников;
	КонецЕсли;;
		
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ВидимостьПроцента();
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	ВидимостьПроцента(); 
	
КонецПроцедуры

