
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	ТаблицаОтпусков = ПолучитьИзВременногоХранилища(Адрес);  
	Диаграмма.Очистить();
	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	Серия.Цвет = WebЦвета.БледноЗеленый;
	
	Для Каждого Строка ИЗ ТаблицаОтпусков Цикл
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		Точка.Текст = Строка.Сотрудник;
						
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

