Функция МассвоеСоздание(Параметр) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
    |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора <= &Дата
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора >= &Дата
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Документ,
	|	ВТ_Договоры.Ссылка КАК Договор
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Договоры.Ссылка = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("Дата", Параметр);  //Параметр.Дата
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Документ.Пустая() Тогда
			
		Документы.РеализацияТоваровУслуг.СозданиеДокумента(Выборка, Массив, Параметр);
			
		Иначе 
				
		Документы.РеализацияТоваровУслуг.ЗаполнениеДокумента(Выборка, Массив);

		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
				
КонецФункции
