

#Область ОбработчикиСобытийФормы 

 &НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	РасчетВидимости(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	Данные = ТекущийЭлемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(Данные.ДатаНачала)Тогда 
	Данные.ДнейОтпуска = ((Данные.ДатаОкончания - Данные.ДатаНачала)/86400)+1;	
	КонецЕсли;
	
	РасчетВидимости();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	Данные = ТекущийЭлемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(Данные.ДатаНачала)Тогда 
	Данные.ДнейОтпуска = ((Данные.ДатаОкончания - Данные.ДатаНачала)/86400)+1;	
	КонецЕсли;
	
	РасчетВидимости();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьГрафик(Команда)  
	
	Адрес = ПодготовитьДанныеГрафика();
	Параметр = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",Параметр,Элементы.ОтпускаСотрудников);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
Процедура РасчетВидимости()

	ДниОтпсука = Новый Соответствие;

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл

		Повтор = ДниОтпсука.Получить(Строка.Сотрудник);

		Если Повтор = Неопределено Тогда

			ДниОтпсука.Вставить(Строка.Сотрудник, Строка.ДнейОтпуска);

			Если Строка.ДнейОтпуска > 28 Тогда

				Сообщение = СтрШаблон("У сотрудника %1 кол-во дней отпуска указано больше 28 дней.", Строка.Сотрудник);
				ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
				Строка.Больше28Дней = Истина;

			Иначе
				
				Строка.Больше28Дней = Ложь;
				ОчиститьСообщения();

			КонецЕсли;
		Иначе

			НовоеЗначение = Повтор + Строка.ДнейОтпуска;
			ДниОтпсука.Вставить(Строка.Сотрудник, НовоеЗначение);

			Если НовоеЗначение > 28 Тогда

				Сообщение = СтрШаблон("У сотрудника %1 кол-во дней отпуска указано больше 28 дней.", Строка.Сотрудник);
				ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);

				Для Каждого СтрокаОтбора Из Объект.ОтпускаСотрудников Цикл

					Если СтрокаОтбора.Сотрудник = Строка.Сотрудник Тогда

						СтрокаОтбора.Больше28Дней = Истина;

					КонецЕсли;

				КонецЦикла;

			Иначе

				Для Каждого СтрокаОтбора Из Объект.ОтпускаСотрудников Цикл

					Если СтрокаОтбора.Сотрудник = Строка.Сотрудник Тогда

						СтрокаОтбора.Больше28Дней = Ложь;
						ОчиститьСообщения();

					КонецЕсли;

				КонецЦикла;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеГрафика()

	ТаблицаОтпусков.Очистить();

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		ОтпускСотрудника = ТаблицаОтпусков.Добавить();
		ОтпускСотрудника.Сотрудник = Строка.Сотрудник;
		ОтпускСотрудника.ДатаНачала = Строка.ДатаНачала;
		ОтпускСотрудника.ДатаОкончания = Строка.ДатаОкончания;

	КонецЦикла;

	ТаблицаПодобранныхТоваров = ТаблицаОтпусков.Выгрузить();

	Возврат ПоместитьВоВременноеХранилище(ТаблицаПодобранныхТоваров, УникальныйИдентификатор);

КонецФункции

#КонецОбласти



