#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
		
		Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
			
			КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
			КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
			КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
			КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
			
			Возврат КомандаСоздатьНаОсновании;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
		
		
	КонецФункции 
	
	Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	КонецПроцедуры
	
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		// Акт об оказании услуг
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "УправлениеПечатью";
		КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслуг";
		КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
		КомандаПечати.Порядок = 5;
		
	КонецПроцедуры
		
	#КонецОбласти   
	
	#Область СлужебныеПроцедурыИФункции
	Функция СоздатьДокументРеализации(Договор,Параметр) Экспорт  
		
		Ревизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"Владелец, Организация");  
		
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Дата = Параметр.Дата;
		НовыйДокумент.Контрагент = Ревизиты.Владелец;
		НовыйДокумент.Организация = Ревизиты.Организация;
		НовыйДокумент.Договор = Договор;
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокумент.Записать();
		Возврат НовыйДокумент;
		
	КонецФункции 
	
	Функция  СозданиеДокумента(Выборка, Массив, Параметр) Экспорт 
		
		НовыйДокумент = СоздатьДокументРеализации(Выборка.Договор,Параметр);
		Если НовыйДокумент.ПроверитьЗаполение() = Истина Тогда 
		НовыйДокумент.ВыполнитьАвтозаполнение(); 
		//Вообщение понятия не имею как отключить заполнение "Основания"
		НовыйДокумент.ПроверитьЗаполнение();

		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		
		ДобавитьСтруктуру = Новый Структура;
		ДобавитьСтруктуру.Вставить("Документ",НовыйДокумент.Ссылка);
		ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
		Массив.Добавить(ДобавитьСтруктуру);
		
	КонецФункции 
	Функция ЗаполнениеДокумента( Выборка, Массив)Экспорт 
		
		Документ = Выборка.Документ.ПолучитьОбъект();
		Документ.ВыполнитьАвтозаполнение(); 
		Документ.ПроверитьЗаполнение();
		Документ.Записать(РежимЗаписиДокумента.Проведение); 
		
		//Надо ли передавать эти данные в таьличную часть Обработки???
		ДобавитьСтруктуру = Новый Структура;
		ДобавитьСтруктуру.Вставить("Документ",Выборка.Документ);
		ДобавитьСтруктуру.Вставить("Договор",Выборка.Договор);
		Массив.Добавить(ДобавитьСтруктуру);
		
	КонецФункции
		
	#КонецОбласти   
#КонецЕсли  






