
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьСозданиеАктов(Команда)    
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда 
		
		Текст = "Необходимо заполнить период";
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат;
		
	КонецЕсли;
	
	ОчиститьСообщения();
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("Дата",Объект.Период); 
	
	ДлительнаяОперация = ЗапуститьДлительнуюОперацию(Объект.Период, УникальныйИдентификатор);  
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСозданиеАктовЗавершение",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация,Оповещение);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция  ЗапуститьДлительнуюОперацию(ПараметрыЗапуска, УникальныйИдентификатор)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,"Документы.РеализацияТоваровУслуг.ВКМ_МассовоеСозданиеАктов",ПараметрыЗапуска);
	
КонецФункции 

&НаКлиенте
Процедура  ВыполнитьСозданиеАктовЗавершение(Результат,ДополнительныеПараметры)Экспорт 
	
	Если Результат = Неопределено Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда 
		
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
		
	КонецЕсли; 
	
	РезультатВычилений = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	
	Объект.ДанныеОбДоговорахИДокументах.Очистить();

	Для Каждого Строка Из РезультатВычилений Цикл  
		
		
	ДаныеТЧ = Объект.ДанныеОбДоговорахИДокументах.Добавить();	
	ДаныеТЧ.Договор = Строка.Договор;
	ДаныеТЧ.Документ = Строка.Документ;
	
	КонецЦикла;
		
КонецПроцедуры
#КонецОбласти

