
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ГрафикОтпусков
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Движения.ВКМ_УчетОтпуска.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.Год = Год;
		Движение.ДатаНачала = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаОтпускаСотрудников.ДатаОкончания;   
		
		//Записть в УчетОтпуска
		ДвижениеОтпуск = Движения.ВКМ_УчетОтпуска.Добавить();  
		ДвижениеОтпуск.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОтпуск.Год = Год;
		ДвижениеОтпуск.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник; 
		ДвижениеОтпуск.Период = Дата;
		ДвижениеОтпуск.ДнейОтпсука = ((ТекСтрокаОтпускаСотрудников.ДатаОкончания - ТекСтрокаОтпускаСотрудников.ДатаНачала)/86400)+1;
		
	КонецЦикла;

КонецПроцедуры
