

#Область СлужебныеПроцедурыИФункции
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кадровик-расчетник";
	ОписаниеПрофиля.Идентификатор = "fca8ae7d-02b5-4523-a83c-778d106a8eb4";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кадровик-расчетник'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("БазоваяФункциональностьТП");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ПраваНаРасчетЗарпалты");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_КадровыеПрава");
//	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
//	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупки");
//	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
//	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНСИ");
//	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзмененияДенежныхДокументов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры
#КонецОбласти
