
#Область СлужебныеПроцедурыИФункции  

Функция  ОтправкаСообщенияТелеграм() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграм.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграм КАК ВКМ_УведомленияТелеграм";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сообщение = "";
	Пока Выборка.Следующий() Цикл
		
		СообщениеСтока = Выборка.ТекстСообщения;
		
		Сообщение = Сообщение + СообщениеСтока + Символы.ПС;
		
	КонецЦикла;
	
	Возврат Сообщение;
	
КонецФункции  

Процедура ОчиститьСправочник() Экспорт 
 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграм.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграм КАК ВКМ_УведомленияТелеграм";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		  СправочникОбъект = Выборка.Ссылка;
		  СправочникОбъект.ПолучитьОбъект().Удалить();
		  
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
	
	
	
